
# Задача №111301. Символ с данным ASCII-кодом
# Считайте со стандартного ввода целое число и выведите ASCII-символ с таким кодом. Решите эту задачу с использованием только одной переменной типа int.

# Входные данные
# Программа получает на вход число от 33 до 126.

# Выходные данные
# Нужно вывести символ, который имеет введенный код

# Примеры
# входные данные
# 65
# выходные данные
# A

a = int(input())
print(chr(a))
