# Задача №111300. ASCII-код символа
# Считайте со стандартного ввода символ и выведите его код.

# Входные данные
# Программа получает на вход один символ с кодом от 33 до 126.

# Выходные данные
# Нужно вывести одно число - код считанного символа

# Примеры
# входные данные
# A
# выходные данные
# 65

a = input()
print(ord(a))